## Exercise:

Write pandas code to report the IDs of all the employees with missing information. The information of an employee is missing if:

    The employee's name is missing, or
    The employee's salary is missing.

Return the result table ordered by employee_id in ascending order.

The query result format is in the following example.

In [3]:
import pandas as pd

# Create the Employees table
employees = pd.DataFrame({
    'employee_id': [2, 4, 5],
    'name': ['Crew', 'Haven', 'Kristian']
})

# Create the Salaries table
salaries = pd.DataFrame({
    'employee_id': [5, 1, 4],
    'salary': [76071, 22517, 63539]
})

In [2]:
employees.describe()

       employee_id
count     3.000000
mean      3.666667
std       1.527525
min       2.000000
25%       3.000000
50%       4.000000
75%       4.500000
max       5.000000

In [3]:
employees.dtypes

employee_id     int64
name           object
dtype: object

In [4]:
employees.columns

Index(['employee_id', 'name'], dtype='object')

In [5]:
employees

   employee_id      name
0            2      Crew
1            4     Haven
2            5  Kristian

In [36]:
merged_1 = employees.merge(salaries, on='employee_id', how='left')
missing_salaries = merged_1[merged_1['salary'].isna()]
missing_salaries

   employee_id  name  salary
0            2  Crew     NaN

In [37]:
merged_2 = employees.merge(salaries, on='employee_id', how='right')
missing_names = merged_2[merged_2['name'].isna()]
missing_names

   employee_id name  salary
1            1  NaN   22517

In [38]:
results = pd.concat([missing_salaries, missing_names], axis=0)
results

   employee_id  name   salary
0            2  Crew      NaN
1            1   NaN  22517.0

In [41]:
output_df = results[['employee_id']].sort_values('employee_id').reset_index(drop=True)
output_df

   employee_id
0            1
1            2

In [42]:
# Create the expected output DataFrame
expected_output = pd.DataFrame({
    'employee_id': [1, 2]
})
expected_output

   employee_id
0            1
1            2

In [43]:
pd.testing.assert_frame_equal(output_df, expected_output, check_dtype=False, check_index_type=False, check_like=True)

In [5]:
joined_df = employees.merge(salaries, on='employee_id', how='outer')
joined_df

   employee_id      name   salary
0            2      Crew      NaN
1            4     Haven  63539.0
2            5  Kristian  76071.0
3            1       NaN  22517.0

In [9]:
cond = joined_df['name'].isnull() | joined_df['salary'].isnull()
missing_info = joined_df[cond]
missing_info

   employee_id  name   salary
0            2  Crew      NaN
3            1   NaN  22517.0

In [10]:
missing_info[['employee_id']].sort_values('employee_id').reset_index(drop=True)

   employee_id
0            1
1            2